{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/policy_network_2/dense_30/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/policy_network_2/dense_30/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/policy_network_2/dense_31/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "42"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/policy_network_2/dense_31/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "42"}]}}}}}, {"name": "StatefulPartitionedCall/policy_network_2/dense_32/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "42"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/policy_network_2/dense_32/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, {"name": "StatefulPartitionedCall/policy_network_2/dense_30/Relu", "op": "_FusedMatMul", "input": ["input_1", "StatefulPartitionedCall/policy_network_2/dense_30/MatMul/ReadVariableOp", "StatefulPartitionedCall/policy_network_2/dense_30/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/policy_network_2/dense_31/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/policy_network_2/dense_30/Relu", "StatefulPartitionedCall/policy_network_2/dense_31/MatMul/ReadVariableOp", "StatefulPartitionedCall/policy_network_2/dense_31/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/policy_network_2/dense_32/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/policy_network_2/dense_31/Relu", "StatefulPartitionedCall/policy_network_2/dense_32/MatMul/ReadVariableOp", "StatefulPartitionedCall/policy_network_2/dense_32/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/policy_network_2/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/policy_network_2/dense_32/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/policy_network_2/softmax/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/policy_network_2/dense_30/MatMul/ReadVariableOp", "shape": [10, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/policy_network_2/dense_30/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/policy_network_2/dense_31/MatMul/ReadVariableOp", "shape": [64, 42], "dtype": "float32"}, {"name": "StatefulPartitionedCall/policy_network_2/dense_31/BiasAdd/ReadVariableOp", "shape": [42], "dtype": "float32"}, {"name": "StatefulPartitionedCall/policy_network_2/dense_32/MatMul/ReadVariableOp", "shape": [42, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/policy_network_2/dense_32/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}]}]}